senserf/picos/PicOS/MSP430/main.c
    	// Worst-case settling time for the DCO when the DCO range bits have
	// been changed is n x 32 x 32 x f_MCLK / f_FLL_reference. See UCS
	// chapter in 5xx UG for optimization.
    	// 32 x 32 x 8 MHz / 32,768 Hz = 250000 = MCLK cycles for DCO to settle
	udelay (250);
	// Loop until XT1 & DCO stabilizes, make sure to execute at least once
	do {
        	UCSCTL7 &= ~(XT2OFFG + XT1LFOFFG + XT1HFOFFG + DCOFFG);
		SFRIFG1 &= ~OFIFG; // Clear fault flags

	} while ((SFRIFG1 & OFIFG));	

#ifdef	PIN_PORTMAP
	{
		word i, j;

		PMAPPWD = PMAPPW;
		// To allow future reconfigurations
		PMAPCTL = PMAPRECFG;

		for (i = 0; i < n_portmap; i++)
			for (j = 0; j < 8; j++)
				*((portmap [i] . pm_base) + j) =
					portmap [i] . map [j];
		PMAPPWD = 0;
	}
#endif	/* PIN_PORTMAP */

#endif	/* __MSP430_6xx__ */

// ===========================================================================
// ===========================================================================
// ===========================================================================

	// System timer (assumes TASSEL0/TACLR is same as TBSSEL0/TBCLR)
	// Source is ACLK, divided by 8 (4096 ticks/sec)

#if TRIPLE_CLOCK
	// Continuous mode
	TCI_CTL = TASSEL0 | TACLR | ID0 | ID1 | MC1;
	TCI_CCS = TCI_SEC_DIV;
	sti_sec;
	sti_aux;
#else
	// Up mode
	TCI_CTL = TASSEL0 | TACLR | ID0 | ID1 | MC0;
#endif

}

void powerdown (void) {

	__pi_systat.pdmode = 1;
	clockdown ();
#if CRYSTAL2_RATE
	// Disable XTL2
	_BIS (BCSCTL1, XT2OFF);
#endif
}

void powerup (void) {

#if CRYSTAL2_RATE
	// Enable XTL2
	_BIC (BCSCTL1, XT2OFF);
#endif
	clockup ();
	__pi_systat.pdmode = 0;
}

#define	mkmk_eval
void udelay (register word n) {
/* =================================== */
/* n should be roughly in microseconds */
/* =================================== */
	__asm__ __volatile__ (
		"1:\n"
#if CPU_CLOCK_RATE > 2000
		" nop\n"
#endif
#if CPU_CLOCK_RATE > 4000
		" nop\n"
#endif
#if CPU_CLOCK_RATE > 6000
		" nop\n"
#endif
#if CPU_CLOCK_RATE > 7000
		" nop\n"
#endif
#if CPU_CLOCK_RATE > 8200
		" nop\n"
#endif
#if CPU_CLOCK_RATE > 9400
		"nop\n"
#endif
#if CPU_CLOCK_RATE > 10600
		"nop\n"
#endif
#if CPU_CLOCK_RATE > 11800
		"nop\n"
#endif
		" dec %[n]\n"
		" jne 1b\n"
			: [n] "+r"(n));
}
#undef	mkmk_eval

void mdelay (word n) {
/* ============ */
/* milliseconds */
/* ============ */
	while (n--)
		udelay (995);
}

// ============================================================================

#if TRIPLE_CLOCK

// ============================================================================
// Version with two clocks and circular timer counter; note that
// HIGH_CRYSTAL_RATE == 0, as the two cannot be set together
// ============================================================================

static word setdel = 0;		// Interval for which the delay timer was set

static word gettav () {
//
// Majority vote read for the timer value (which we are not supposed to read)
//
	word del;

	while (1) {
		del = TCI_VAL;
		if (TCI_VAL == del && TCI_VAL == del && TCI_VAL == del)
			return del;
	}
}

void tci_run_delay_timer () {
//
// Set the delay timer according to __pi_mintk
//
	word d;

	// cli_tim;	// This should be redundant

	// Time to elapse in msecs
	d = __pi_mintk - __pi_old;

	// Don't exceed the maximum
	setdel = (d > TCI_MAXDEL) ? TCI_MAXDEL : d;

	TCI_CCR = gettav () + TCI_DELTOTICKS (setdel);
	sti_tim;
}

void tci_run_auxiliary_timer () {
//
// Start the auxiliary timer
//
	cli_aux;	// In case we are only resetting
	TCI_CCA = gettav () + TCI_HIGH_DIV;
	sti_aux;
}

word tci_update_delay_ticks (Boolean force) {
//
// Called to stop the timer, if running, and tally up the ticks
//
	cli_tim;
	if (setdel) {
		// The timer has been running, otherwise we don't have to
		// bother; force tells whether we have to stop the timer (e.g.,
		// catering to a new delay request), or whether we are just
		// checking; if !force, and the timer is running, just let
		// it go and return YES, to tell update_n_wake to exit;
		// when we return NO, it means that we actually have to
		// examine the delay queue; in such a case, the timer will
		// be restarted later
		if (force) {
			// the role of the 3 is to round it up, such that the
			// estimate will tend to err on the low side,
			// which will make sure that the measured delay is
			// never less than asked for
			__pi_new +=
			    setdel - TCI_TICKSTODEL (TCI_CCR - gettav () + 3);
			// Use it only once
			setdel = 0;
			goto EX;
		}
		sti_tim;
		return YES;
	}
EX:
	return NO;
}
		
// ============================================================================
// Timer interrupts for the triple-clock version ==============================
// ============================================================================

interrupt (TCI_VECTOR_S) timer_auxiliary () {
//
// Two in one: one of them runs exactly every second and is used to maintain
// a precise seconds clock; the other is used for utimers, debouncing,
// blinking leds, and other stuff registered in irq_timer.h.
//
	word aux_timer_inactive;

	// This test also removes the interrupt status
	if (TCI_AUXILIARY_TIMER_INTERRUPT) {

#ifdef	MONITOR_PIN_CLOCKA
		_PVS (MONITOR_PIN_CLOCKA, 1);
#endif
		// Set for the next tick - as quickly as possible
		TCI_CCA += TCI_HIGH_DIV;
		// Flag == should we continue?
		aux_timer_inactive = 1;
		// Take care of utimers
		if (__pi_utims [0] == 0)
			goto EUT;
		if (*(__pi_utims [0])) {
			(*(__pi_utims [0]))--;
			aux_timer_inactive = 0;
		}
		if (__pi_utims [1] == 0)
			goto EUT;
		if (*(__pi_utims [1])) {
			(*(__pi_utims [1]))--;
			aux_timer_inactive = 0;
		}
		if (__pi_utims [2] == 0)
			goto EUT;
		if (*(__pi_utims [2])) {
			(*(__pi_utims [2]))--;
			aux_timer_inactive = 0;
		}
		if (__pi_utims [3] != 0) {
			if (*(__pi_utims [3])) {
				(*(__pi_utims [3]))--;
				aux_timer_inactive = 0;
			}
		}
EUT:
// ============================================================================
#include "irq_timer.h"
// ============================================================================
		if (aux_timer_inactive)
			// Nobody wants us
			cli_aux;

