senserf/picos/PicOS/MSP430/main.c
#ifdef	MONITOR_PIN_CLOCKA
	_PVS (MONITOR_PIN_CLOCKA, 0);
#endif
		RTNI;
	}

#ifdef	MONITOR_PIN_CLOCKS
	_PVS (MONITOR_PIN_CLOCKS, 1);
#endif
	// This is the seconds clock. I thought about reducing its rate even
	// further. Note that theoretically, the clock can tick once per 16
	// seconds (the wraparound of the timer, with TCI_CCS being fixed).
	// The actual number of seconds within the last 16th could be derived
	// from the difference between the timer and TCI_CCS. There is,
	// however, a nasty race that gets in the way. Namely, we may have
	// a situation when the timer == TCI_CCS and we don't know whether
	// __pi_nseconds has been updated or not. Note that this problem is
	// avoided in the delay timer where setdel makes it clear which is
	// the case.
	//
	// Perhaps this would work:
	//
	//	cli_aux;
	//	gettav ->
	//	timer != TCI_CCS -> easy, calculate the difference
	//	timer == TCI_CCS -> delay for 1 us and check TBIF
	//		TBIF == 1 -> __pi_nseconds not updated
	//		TBIF == 0 -> __pi_nseconds updated
	//
	// This looks complicated and, perhaps, does not warrant the
	// modification, especially that there are arguments for having the
	// tick every second (or so), e.g., for diagnosing stack overflow,
	// or handling the stuff in "second.h".
	//

	TCI_CCS += TCI_SEC_DIV;
	__pi_nseconds++;
	check_stack_overflow;
// ============================================================================
#include "second.h"
// ============================================================================

#ifdef	MONITOR_PIN_CLOCKS
	_PVS (MONITOR_PIN_CLOCKS, 0);
#endif

	RTNI;
}

interrupt (TCI_VECTOR) timer_int () {

#ifdef	MONITOR_PIN_CLOCK
	_PVS (MONITOR_PIN_CLOCK, 1);
#endif
	// This one serves only delays; utimers are handled by the debounce
	// timer

	cli_tim;
	__pi_new += setdel;
	setdel = 0;	// Mark that the counting has been accomplished
	RISE_N_SHINE;

#ifdef	MONITOR_PIN_CLOCK
	_PVS (MONITOR_PIN_CLOCK, 0);
#endif
	RTNI;
}

#else	/* TRIPLE_CLOCK */

// ============================================================================
// Timer interrupt and clock modes for the single clock case ==================
// ============================================================================

// clockdown/clockup are macros defined in mach.h

interrupt (TCI_VECTOR) timer_int () {

	word d;

#ifdef	MONITOR_PIN_CLOCK
	_PVS (MONITOR_PIN_CLOCK, 1);
#endif

	// Clear hardware watchdog. Its sole purpose is to guard clock
	// interrupts, with clock interrupts acting as software watchdog.

#if HIGH_CRYSTAL_RATE == 0
	// We have two distinct modes for the clock
	if (TCI_CCR == TCI_INIT_HIGH) {
#endif
		// Power up: one tick == 1 JIFFIE
		/* This code assumes that MAX_UTIMERS is 4 */
#define	UTIMS_CASCADE(x) 	if (__pi_utims [x]) {\
					 if (*(__pi_utims [x]))\
						 (*(__pi_utims [x]))--
		UTIMS_CASCADE(0);
		UTIMS_CASCADE(1);
		UTIMS_CASCADE(2);
		UTIMS_CASCADE(3);
		}}}}
#undef UTIMS_CASCADE

#if	ADC_PRESENT
		// Stub
#endif

		// Extras
#include "irq_timer.h"

		__pi_new++;

		d = __pi_new - __pi_old;

		if (d >= JIFFIES || twakecnd (__pi_old, __pi_new, __pi_mintk))
			RISE_N_SHINE;

#ifdef	MONITOR_PIN_CLOCK
		_PVS (MONITOR_PIN_CLOCK, 0);
#endif
		RTNI;

#if HIGH_CRYSTAL_RATE == 0
	// We actually do have two different modes
	}

	// Here we are running in the SLOW mode: one tick ==
	// JIFFIES/TCI_LOW_PER_SEC

#define	UTIMS_CASCADE(x) \
		if (__pi_utims [x]) { \
		  if (*(__pi_utims [x])) \
		    *(__pi_utims [x]) = *(__pi_utims [x]) > \
		      (JIFFIES/TCI_LOW_PER_SEC) ? \
			*(__pi_utims [x]) - (JIFFIES/TCI_LOW_PER_SEC) : 0

	UTIMS_CASCADE(0);
	UTIMS_CASCADE(1);
	UTIMS_CASCADE(2);
	UTIMS_CASCADE(3);
	}}}}
#undef UTIMS_CASCADE

	__pi_new += JIFFIES/TCI_LOW_PER_SEC;

	d = __pi_new - __pi_old;

#if TCI_LOW_PER_SEC > 1
	if (d >= JIFFIES || twakecnd (__pi_old, __pi_new, __pi_mintk))
#endif
		RISE_N_SHINE;

#ifdef	MONITOR_PIN_CLOCK
	_PVS (MONITOR_PIN_CLOCK, 0);
#endif
	RTNI;
#endif	/* HIGH_CRYSTAL_RATE == 0 */
}

#endif	/* TRIPLE_CLOCK */

#if GLACIER

// ============================================================================

#if TRIPLE_CLOCK
#error "S: GLACIER is not compatible (and not needed) with TRIPLE_CLOCK"
#endif

#if HIGH_CRYSTAL_RATE
#error "S: GLACIER is not compatible with HIGH_CRYSTAL_RATE!!"
#endif

// ============================================================================

void freeze (word nsec) {
/*
 * Freezes the system in power-down mode for the specified number of seconds.
 */
	byte saveP1IE, saveP2IE;

#if UART_DRIVER || UART_TCV
	word saveUIE;
#endif
	byte saveLEDsV, saveLEDsB;

	// In case some of these take too long for the clock guard
	cli;

	// Save I/O pin interrupt configuration
	saveP1IE = P1IE;
	saveP2IE = P2IE;
	// And disable them
	P1IE = P2IE = 0x00;

#if LEDS_DRIVER
	// Save leds status and turn them off
	leds_save (saveLEDsV, saveLEDsB);
#endif

#if UART_DRIVER || UART_TCV
	
	// Save and disable UART interrupt configuration
	uart_save_ie_flags (saveUIE);
	uart_a_wait_tx;
#ifdef UART_PREINIT_B
	uart_b_wait_tx;
#endif
#endif
	powerdown ();
	// Save clock state

	while (1) {
		_BIS_SR (LPM3_bits + GIE);
		cli;
		if (nsec == 0)
			break;
		nsec--;
	}

	P1IE = saveP1IE;
	P2IE = saveP2IE;

#if UART_DRIVER || UART_TCV
	// Reset the UART to get it back to normal
	uart_a_reset_on;
	uart_a_reset_off;
#ifdef 	UART_PREINIT_B
	uart_b_reset_on;
	uart_b_reset_off;
#endif
	uart_restore_ie_flags (saveUIE);
#endif
	powerup ();

	// Trigger the interrupts if they are pending
	P1IFG = (P1IE & (P1IES ^ P1IN));
	P2IFG = (P2IE & (P2IES ^ P2IN));

#if LEDS_DRIVER
	leds_restore (saveLEDsV, saveLEDsB);
#endif
	sti;
}

#endif	/* GLACIER */

static void mem_init () {

	__pi_malloc_init ();
}

#if	STACK_GUARD
word __pi_stackfree (void) {

	word sc;
	for (sc = 0; sc < STACK_SIZE / sizeof (word); sc++)
		if (*(((word*)STACK_END) + sc) != STACK_SENTINEL)
			break;
	return sc;
}

#endif

static void ios_init () {

#if MAX_TASKS > 0
	__pi_pcb_t *p;

	for_all_tasks (p)
		/* Mark all task table entries as available */
		p->code = NULL;
#endif

