senserf/picos/PicOS/MSP430/main.c
#ifdef	EMERGENCY_STARTUP_CONDITION

	if (EMERGENCY_STARTUP_CONDITION) {
		EMERGENCY_STARTUP_ACTION;
	}
#endif

// ============================================================================
// Praxis-dependent extra initialization ======================================
// ============================================================================

#ifdef	SENSOR_INITIALIZERS
	__pi_init_sensors ();
#endif

#ifdef	ACTUATOR_INITIALIZERS
	__pi_init_actuators ();
#endif

#ifdef	EXTRA_INITIALIZERS
	// Extra initialization
	EXTRA_INITIALIZERS;
#endif

#if	UART_DRIVER || UART_TCV
	// A UART is configured, initialize it beforehand without enabling
	// anything, which is up to the driver plugin. We just want to be able
	// to use diag.
	preinit_uart ();
#endif

#if	DIAG_MESSAGES
	diag ("");

#ifdef	BANNER
	diag (BANNER);
#else
	diag ("PicOS v" SYSVER_S "/" SYSVER_R
#ifdef	SYSVER_B
		"-" SYSVER_B
#endif
        	", (C) Olsonet Communications, 2002-2016");
	diag ("Leftover RAM: %d bytes", (word)STACK_END - (word)(&__bss_end));
#endif

#endif	/* DIAG_MESSAGES */

	dbg_1 (0x1000 | SYSVER_X);
	dbg_1 ((word)STACK_END - (word)(&__bss_end)); // RAM in bytes

#if MAX_DEVICES
	/* Initialize devices */
	int i;
	for (i = UART; i < MAX_DEVICES; i++)
		if (devinit [i] . init != NULL)
			devinit [i] . init (devinit [i] . param);
#endif
	/* Make SMCLK/MCLK available on P5.5, P5.4 */
	//_BIS (P5OUT, 0x30);
	//_BIS (P5SEL, 0x30);
}

/* ------------------------------------------------------------------------ */
/* ============================ DEVICE DRIVERS ============================ */
/* ------------------------------------------------------------------------ */

#if	UART_DRIVER || UART_TCV

uart_t	__pi_uart [N_UARTS];

static void preinit_uart () {

#ifdef	UART_PREINIT_A
	// UART_A
	UART_PREINIT_A;
	uart_a_reset_on;
	uart_a_set_clock;
	uart_a_set_rate_def;
	uart_a_set_write_int;
	uart_a_enable;
	uart_a_reset_off;
#if UART_RATE_SETTABLE
	__pi_uart [0] . flags = UART_RATE_INDEX;
#endif

#endif	/* UART_PREINIT_A */

/*
 * Note: the second UART doesn't want to work at 9600 with the standard slow
 * crystal. The xmitter is OK, but the receiver gets garbage. 4800 is fine. 
 * Also, things seem to work fine (up to 115200) with a high speed crystal.
 */
#ifdef	UART_PREINIT_B
	// UART_B
	UART_PREINIT_B;
	uart_b_reset_on;
	uart_b_set_clock;
	uart_b_set_rate_def;
	uart_b_set_write_int;
	uart_b_enable;
	uart_b_reset_off;
#if UART_RATE_SETTABLE
	__pi_uart [1] . flags = UART_RATE_INDEX;
#endif

#endif	/* UART_PREINIT_B */
}

#if UART_RATE_SETTABLE

static const uart_rate_table_entry_t urates [] = UART_RATE_TABLE;

#define	N_RATES		(sizeof(urates) / sizeof(uart_rate_table_entry_t))

Boolean __pi_uart_setrate (word rate, uart_t *ua) {

	byte j;

	for (j = 0; j < N_RATES; j++) {
		if (rate == urates [j] . rate) {
			// Found
#if N_UARTS > 1
			if (ua != __pi_uart)
				uart_b_set_rate (urates [j]);
			else
#endif	/* N_UARTS */
				uart_a_set_rate (urates [j]);
			ua->flags = (ua->flags & ~UART_RATE_MASK) | j;
			return YES;
		}
	}
	return NO;
}

word __pi_uart_getrate (uart_t *ua) {

	return urates [ua->flags & UART_RATE_MASK] . rate;
}

#endif 	/* UART_RATE_SETTABLE */

#endif	/* UART_DRIVER || UART_TCV */

// ============================================================================

#if	UART_DRIVER
/* ======== */
/* The UART */
/* ======== */

#define	uart_write8(u,w) \
	__usel (u, uart_b_write (w), uart_a_write (w))

#define uart_enable_write_int(u) __usel (u, uart_b_enable_write_int, \
						uart_a_enable_write_int)

#define uart_disable_int(u)	__usel (u, uart_b_disable_int, \
						uart_a_disable_int)

#define uart_disable_read_int(u) __usel (u, uart_b_disable_read_int, \
						uart_a_disable_read_int)

#define uart_disable_write_int(u) __usel (u, uart_b_disable_write_int, \
						uart_a_disable_write_int)

#define	uart_read(u)		__ualt (u, uart_b_read, uart_a_read)

#define uart_enable_read_int(u)	__usel (u, uart_b_enable_read_int, \
						uart_a_enable_read_int)

/* ======================= */
/* Common request function */
/* ======================= */
static INLINE int ioreq_uart (uart_t *u, int operation, char *buf, int len) {

	switch (operation) {

		case READ:

#if UART_INPUT_BUFFER_LENGTH > 1
			uart_disable_read_int (u);
			if (u->ib_count == 0) {
				// The buffer is empty
				_BIS (u->flags, UART_FLAGS_IN);
				return -2;
			}
			_BIC (u->flags, UART_FLAGS_IN);
			uart_enable_read_int (u);
			operation = len;
			while (len) {
				uart_disable_read_int (u);
				if (u->ib_count == 0) {
					uart_enable_read_int (u);
					break;
				}
				u->ib_count--;
				uart_enable_read_int (u);
				*buf++ = u->in [u->ib_out];
				if (++(u->ib_out) == UART_INPUT_BUFFER_LENGTH)
					u->ib_out = 0;
				len--;
			}
			return operation - len;
#else
			if ((u->flags & UART_FLAGS_IN)) {
				// Receive interrupt is disabled
R_redo:
				*buf = u->in;
				_BIC (u->flags, UART_FLAGS_IN);
				uart_enable_read_int (u);
				return 1;
			}
			uart_disable_read_int (u);
			if ((u->flags & UART_FLAGS_IN))
				// Account for the race
				goto R_redo;
			// The buffer is empty
			return -2;
#endif
		case WRITE:

#if defined(blue_ready) && defined(BLUETOOTH_UART)
			// Bluetooth on UART
			if (
#if N_UARTS > 1
				// There is a choice of UARTs, have to check if
				// this is the one
				u
#if BLUETOOTH_UART == 0
				   // BT on UART 0
				   ==
#else
				   // BT on UART 1
				   !=
#endif	/* UART 0 or 1 */
				      __pi_uart &&
#endif	/* Multiple UARTs */
					(u->flags & UART_FLAGS_NOTRANS) == 0 &&
					  // BT must be connected
					  !blue_ready)
								return 1;
#endif	/* Transparent BT */
			if ((u->flags & UART_FLAGS_OUT) == 0) {
X_redo:
				u->out = *buf;
				_BIS (u->flags, UART_FLAGS_OUT);
				uart_enable_write_int (u);
				return 1;
			}
			uart_disable_write_int (u);
			if ((u->flags & UART_FLAGS_OUT) == 0)
				goto X_redo;
			return -2;
					
		case NONE:

			// Cleanup
#if UART_INPUT_BUFFER_LENGTH < 2
			if ((u->flags & UART_FLAGS_IN) == 0) {
				uart_enable_read_int (u);
			}
#else
				uart_enable_read_int (u);
#endif
			if ((u->flags & UART_FLAGS_OUT))
				uart_enable_write_int (u);

