senserf/picos/PicOS/MSP430/main.c
			return 0;

		case CONTROL:

#if UART_RATE_SETTABLE
			if (len == UART_CNTRL_SETRATE) {
				if (__pi_uart_setrate (*((word*)buf), u))
						return 1;
				syserror (EREQPAR, "uar");
			}

			if (len == UART_CNTRL_GETRATE) {
				*((word*)buf) = __pi_uart_getrate (u);
				return 1;
			}
#ifdef blue_ready
			if (len == UART_CNTRL_TRANSPARENT) {
				if (*((word*)buf))
					_BIC (u->flags, UART_FLAGS_NOTRANS);
				else
					_BIS (u->flags, UART_FLAGS_NOTRANS);
				return 1;
			}
#endif

#endif
			/* Fall through */
		default:
			syserror (ENOOPER, "uai");
			/* No return */
			return 0;
	}
}

/* ========================== */
/* Interrupt service routines */
/* ========================== */

#ifdef	UART_A_TX_RX_VECTOR
//
// This means that there is a single vector for both RX and TX, as in CC430
//
interrupt (UART_A_TX_RX_VECTOR) uart_a_tx_rx_int (void) {

	if (uart_a_tx_interrupt) {

// ============================================================================

#else

interrupt (UART_A_TX_VECTOR) uart_a_tx_int (void) {

// ============================================================================

#endif

// ============================================================================
// TX interrupt service =======================================================
// ============================================================================

	// Disable until a character arrival
	uart_a_disable_write_int;

#if NESTED_INTERRUPTS
	// Enable other interrupts. Note: we do this only for UART0.
	sti;
#endif
	RISE_N_SHINE;

	if ((__pi_uart [0] . flags & UART_FLAGS_OUT) == 0) {
		// Keep the interrupt pending
		uart_a_set_write_int;
	} else {
		_BIC (__pi_uart [0] . flags, UART_FLAGS_OUT);
		uart_a_write (__pi_uart [0] . out);
	}
	i_trigger (devevent (UART_A, WRITE));
	RTNI;
}

#ifdef UART_A_TX_RX_VECTOR

	else {

#else

interrupt (UART_A_RX_VECTOR) uart_a_rx_int (void) {

#endif

// ============================================================================
// RX interrupt service =======================================================
// ============================================================================

#define	ua	(__pi_uart + 0)

	uart_a_disable_read_int;

#if NESTED_INTERRUPTS
	// Enable other interrupts (UART0 only)
	sti;
#endif

#if UART_INPUT_BUFFER_LENGTH > 1

	if (ua->ib_count <= UART_INPUT_BUFFER_LENGTH) {
		// Not full
		ua->in [ua->ib_in] = uart_a_read;
		if (++(ua->ib_in) == UART_INPUT_BUFFER_LENGTH)
			ua->ib_in = 0;
		ua->ib_count++;
	}

	if ((ua -> flags & UART_FLAGS_IN)) {
		RISE_N_SHINE;
		i_trigger (devevent (UART_A, READ));
	}

#if NESTED_INTERRUPTS
	cli;
#endif
	uart_a_enable_read_int;

#else	/* UART_INPUT_BUFFER_LENGTH */

	RISE_N_SHINE;

	if ((ua -> flags & UART_FLAGS_IN)) {
		// Keep the interrupt pending
		uart_a_set_read_int;
	} else {
		_BIS (ua -> flags, UART_FLAGS_IN);
		ua -> in = uart_a_read;
	}
	i_trigger (devevent (UART_A, READ));
#endif
	RTNI;

}

#ifdef UART_A_TX_RX_VECTOR
}
#endif

// ============================================================================

static int ioreq_uart_a (int op, char *b, int len) {
	return ioreq_uart (ua, op, b, len);
}

#undef ua

#if UART_DRIVER > 1

interrupt (UART_B_TX_VECTOR) uart_b_tx_int (void) {
	RISE_N_SHINE;

	if ((__pi_uart [1] . flags & UART_FLAGS_OUT) == 0) {
		// Keep the interrupt pending
		uart_b_set_write_int;
	} else {
		_BIC (__pi_uart [1] . flags, UART_FLAGS_OUT);
		uart_b_write (__pi_uart [1] . out);
	}
	// Disable until a character arrival
	uart_b_disable_write_int;
	i_trigger (devevent (UART_B, WRITE));
	RTNI;
}

interrupt (UART_B_RX_VECTOR) uart_b_rx_int (void) {

#define	ua	(__pi_uart + 1)

#if UART_INPUT_BUFFER_LENGTH > 1

	if (ua->ib_count <= UART_INPUT_BUFFER_LENGTH) {
		// Not full
		ua->in [ua->ib_in] = uart_b_read;
		if (++(ua->ib_in) == UART_INPUT_BUFFER_LENGTH)
			ua->ib_in = 0;
		ua->ib_count++;
	}
	if ((ua -> flags & UART_FLAGS_IN)) {
		RISE_N_SHINE;
		i_trigger (devevent (UART_B, READ));
	}
#else
	RISE_N_SHINE;

	if ((ua -> flags & UART_FLAGS_IN)) {
		// Keep the interrupt pending
		uart_b_set_read_int;
	} else {
		_BIS (ua -> flags, UART_FLAGS_IN);
		ua -> in = uart_b_read;
	}
	uart_b_disable_read_int;
	i_trigger (devevent (UART_B, READ));
#endif
	RTNI;
}

static int ioreq_uart_b (int op, char *b, int len) {
	return ioreq_uart (ua, op, b, len);
}

#undef ua

#endif

/* =========== */
/* Initializer */
/* =========== */
static void devinit_uart (int devnum) {

#if UART_DRIVER > 1
	if (devnum == 0) {
#endif
		adddevfunc (ioreq_uart_a, UART_A);
#if UART_DRIVER > 1
	} else {
		adddevfunc (ioreq_uart_b, UART_B);
	}
#endif

#if UART_INPUT_BUFFER_LENGTH > 1
	__pi_uart [devnum] . ib_count = __pi_uart [devnum] . ib_in =
		__pi_uart [devnum] . ib_out = 0;
#endif

#if UART_DRIVER > 1
	__pi_uart [devnum] . selector = devnum;
#endif
	uart_enable_read_int (__pi_uart + devnum);
}

/* =========== */
/* UART DRIVER */
/* =========== */
#endif

/* ============== */
/* End of drivers */
/* ============== */
